from typing import Dict, List


# Symbol restoration tables (ukr <-> lat/symbols)
letters_rest_table: Dict[str, List[str]] = {
        'а': ['a', '@', '4'],
        'б': ['b', '6'],
        'в': ['v', 'w'],
        'г': ['h', 'g'],
        'ґ': ['g'],
        'д': ['d'],
        'е': ['e', '3'],
        'є': ['ye', 'je', 'e'],
        'ж': ['zh', 'j'],
        'з': ['z', '3'],
        'и': ['y', 'i'],
        'і': ['i', '1', '!'],
        'ї': ['yi', 'ji', 'i'],
        'й': ['i', 'y', 'j'],
        'к': ['k', 'c', 'q'],
        'л': ['l', '1', '|'],
        'м': ['m'],
        'н': ['n', 'h'],
        'о': ['o', '0'],
        'п': ['p'],
        'р': ['r', 'p'],
        'с': ['s', 'c', '$', '5'],
        'т': ['t', '7'],
        'у': ['u', 'y'],
        'ф': ['f', 'ph'],
        'х': ['h', 'x', 'kh'],
        'ц': ['c', 'ts'],
        'ч': ['ch', '4'],
        'ш': ['sh'],
        'щ': ['sch', 'shh'],
        'ь': ["'", "`"],
        'ю': ['yu', 'ju', 'u'],
        'я': ['ya', 'ja'],
}

special_symbols_map: Dict[str, str] = {
        '@': 'а',
        '!': 'і',
        '1': 'і',
        '3': 'з',
        '0': 'о',
        '$': 'с',
        '#': 'ш',
        '*': '',
        '-': '',
        '_': '',
}

